package Games;

import java.util.Locale;

public class Dictionary {
    public static final String[] wordsEasy = {
// 3 буквы
            "пол","лоб",
            "кол","мох",
            "яма","час",
            "зло","ток",
            "год","еда",
// 4 буквы
            "торт","корт",
            "фонд","рыба",
            "вино","дыня",
            "изюм","краб",
// 5 букв
            "гольф","гараж",
            "тыква","диван",
            "школа","лампа",
            "книга","вирус",
            "дождь","зачет",
// 6 букв
            "кружка","анчоус",
            "пальто","лопата",
            "власть","задача",
            "ирония","кожура",
            "листок","могила",

    };
    public static final String[] wordsMedium = {
//            7
            "леопард","балласт",
            "ноутбук","конфета",
            "телефон","варенье",
            "дворник","зеркало",
            "кенгуру","медведь",
//            8
            "аллергия","аквариум",
            "дубликат","жидкость",
            "изолятор","поместье",
            "провиант","рукоятка",
            "растение","свидание",
//            9
            "коромысло","лягушонок",
            "инкубатор","жаворонок",
            "двигатель","диаграмма",
            "бадминтон","проповедь",
            "расстегай","трубочист",
            "фломастер","фейерверк",
//            10
            "автовокзал","гиппопотам",
            "гравировка","жеребьевка",
            "инкассатор","коммуналка",
            "ларинголог","меланхолия",
            "неуважение","окружность",
    };
    public static final String[] wordsHard = {
//            11
            "рефакторинг","одиночество",
            "аспирантура","бездарность",
            "волейболист","домохозяйка",
            "информатика","катализатор",
            "мотоциклист","ремесленник",
//            12
            "человечество","влюблённость",
            "автомобилист","домовладелец",
            "еженедельник","журналистика",
            "интеллектуал","многогранник",
            "руководитель","товарищество",
//            13
            "администратор","водопроводчик",
            "грабительство","корреспондент",
            "многоугольник","робототехника",
            "умозаключение","фальсификация",
            "автобиография","вспыльчивость",
//            14
            "абстракционизм","автомагистраль",
            "анестезиология","вымогательство",
            "восьмиугольник","военнослужащий",
            "внимательность","многогранность",
            "местоположение","кровоснабжение",
            "кровообращение","парикмахерская",
            //сделать нормальный словарь для слов (Даша сказала, что лучше подключить библиотеку какую-нибудь)
    };
}
